/******************************************************************************
 * jcf.ctrl.JCFDebug
 *
 * プログラム名     : jcf.ctrl.JCFDebug
 * 担当者           : itac）南楠
 *-----------------------------------------------------------------------------
 * 【修正履歴】
 * +-------+------------+-------------------+----------------------------------
 * | 版数  | 修正日     | 担当者            | 修正概要
 * +-------+------------+-------------------+----------------------------------
 * | 初版  | 2024/08/31 | itac）南楠  | JCFDebug を新規作成
 * +-------+------------+-------------------+----------------------------------
 *
 * All Rights Reserved, Copyright (C) Fujitsu Limited & MEGMILK SNOW BRAND Co.,Ltd 2013-2025.
 ******************************************************************************/
export class JCFDebug {
  public static write(
    className: string,
    methodName: string,
    ...args: any[]
  ): void {
    console.log(`Class: ${className}, Method: ${methodName}, Args:`, ...args)
  }
}
