export enum Message {
  /** 「&1」を入力してください。 */
  SMSCMNMCA002 = '「&1」を入力してください。',
  /** &1が完了しました。 */
  YCSCMNMSI096 = '&1が完了しました。',
  /** &1が&2を超えています。 */
  YCSCMNMCW170 = '&1が&2を超えています。',
  /** &1できません。 */
  YCSCMNMCW208 = '&1できません。',
  /** &1は存在しません。 */
  YCSCMNMCW219 = '&1は存在しません。',
  /** 削除処理を実行します。よろしいですか。 */
  YCSCMNMSC003 = '削除処理を実行します。よろしいですか。',
  /** 工場名称取得エラー */
  YPMSGSMSC001 = '工場名称取得エラー',
  /** すでに月締め処理がされているため、&1はできません。 */
  YPMGNSMCE004 = 'すでに月締め処理がされているため、&1はできません。',
  /** 表示データの初期化処理を実行してよろしいですか。 */
  YPMSGSMCC009 = '表示データの初期化処理を実行してよろしいですか。',
  /** &1。よろしいですか。 */
  YSDCMNMSC033 = '&1。よろしいですか。',
  /** 登録が完了しました。 */
  MSGID_REGIST_OK = '登録が完了しました。',
}
