/*
 ******************************************************************************
 * regexp-rules
 *
 * システム名       : 共通部品
 * サブシステム名   : 共通部品
 * プログラム名     : 日付（時分別々）
 * 担当者           : 共通部品
 *-----------------------------------------------------------------------------
 * 【修正履歴】
 * +-------+------------+-------------------+----------------------------------
 * | 版数  | 修正日     | 担当者            | 修正概要
 * +-------+------------+-------------------+----------------------------------
 * | 改訂版  | 2024/01/30 | 共通部品          | NUMBER_ONLYの修正、NUMBER_INPUT_ONLYの削除
 * +-------+------------+-------------------+----------------------------------
 *
 * All Rights Reserved, Copyright (C) Fujitsu Limited & MEGMILK SNOW BRAND Co.,Ltd 2013-2025.
 ******************************************************************************
 */
export const RegexpRules = {
  /**
   * @description
   * 英字、数字、記号、ひらがな、カタカナ、第一水準漢字、第二水準漢字（※拡張文字も入力対象とする。）
   * 半角項目は半角文字のみ、全角項目は全角文字のみ。
   * ※規定値と違う場合、値全体を削除するため、ここのルールは上記以外の任意値とゆう意味。
   * @see 漢字コード参照: https://kanji.jitenon.jp/kanjig/3054.html
   */
  TEXT_INPUT_RULE:
    /[^A-Za-z0-9!-/:-@\[-~\u3040-\u309F\u30A0-\u30FF\u4e9c-\u7199\u5f0c-\u7199]/g,

  /**
   * @description
   * 1桁目は：「-、+、数字」のみ
   * 1桁目以後は：「任意桁の数字」のみ
   * 小数点を付ける場合：「.」は一つのみ、小数は2桁のみ
   * ※規定値と違う場合、値全体を削除するため、ここのルールは上記以外の任意値とゆう意味。
   */
  NUMBER_INPUT_RULE: /^(?![\+\-]?\d+(\.\d{0,2})?$).*/g,

  /** @description 数値のみ以外の任意値 */
  NUMBER_ONLY: /[^\d]$/g,

  /** @description 2桁以上の数値 */
  DOUBLE_DIGIT_RULE: /(?<=\d\d)\d/g,

  /** @description 1951-2050以外の4桁数字 */
  YEAR_INPUT_RULE:
    /^(?!195[1-9]|196\d|197\d|198\d|199\d|20[0-4]\d|2050)\d{4}$|^(?![\d]{0,4}$).*$/g,

  /** @description [1-9,01-09,10-12]以外の2桁数字 */
  MONTH_INPUT_RULE: /^(?!0[1-9]|1[0-2]|[1-9]$)\d{2}$|^(?![\d]{0,2}$).*$/g,

  /** @description [1-9,01-09,10-31]以外の2桁数字 */
  DATE_INPUT_RULE: /^(?!0[1-9]|[1-2][0-9]|3[0-1]$)\d{2}$|^(?![\d]{0,2}$).*$/g,

  /** @description [00-09,10-19,20-23]以外の2桁数字 */
  HOUR_INPUT_RULE: /^(?!0[0-9]|1[0-9]|2[0-3]$)\d{2}$|^(?![\d]{0,2}$).*$/g,

  /** @description [00-59]以外の2桁数字 */
  MINUTE_INPUT_RULE: /^(?![0-5][0-9]$)\d{2}$|^(?![\d]{0,2}$).*$/g,

  /** @description 正の整数 */
  POSITIVE_INTEGER_RULE: /^[1-9]\d*$/g,

  /** @description 全角数字 */
  ZENKAKU_SUUJI: /^[\uFF10-\uFF19]*$/g,

  /**
   * @description カンマ区切り数字
   * - カンマ無し可
   * - 全体任意桁数
   * - 小数点後任意桁数
   * - 正負可
   */
  COMMA_SEPARATED_NUMBER: /^([+-]?\d{0,3}(,\d{3})*|\d+)(\.\d+)?$/,
}
